zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/coord/main.c
	/* Start timer to initiate next broadcast data transmission. */
	sw_timer_start(APP_TIMER_BC_DATA,
			((uint32_t)APP_BC_DATA_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)bc_data_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}

/*
 * @brief Callback function for initiation of indirect data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
#ifdef SIO_HUB
const char Display_Queue_Device_Data[] = "Queue data for device %u ";
const char Display_MSDU_Handle[] = "(MSDU handle:  %u)\r\n";
#endif
static void indirect_data_cb(void *parameter)
{
	uint16_t cur_device;
	uint8_t src_addr_mode;
	wpan_addr_spec_t dst_addr;
	const char *payload = "Indirect Data from Coordinator";

	/* Loop over all associated devices. */
	for (cur_device = 0; cur_device < no_of_assoc_devices; cur_device++) {
#ifdef SIO_HUB
		printf(Display_Queue_Device_Data, (cur_device + 1));
#endif

		/*
		 * Request transmission of indirect data to device.
		 * This will just queue this frame into the indirect data queue.
		 * Once this particular device polls for pending data,
		 * the frame will be delivered to the device.
		 */
		src_addr_mode = WPAN_ADDRMODE_SHORT;
		dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
		dst_addr.PANId = DEFAULT_PAN_ID;
		dst_addr.Addr.short_address
			= device_list[cur_device].short_addr;
		curr_msdu_handle++; /* Increment handle */

#ifdef SIO_HUB
		printf(Display_MSDU_Handle, curr_msdu_handle);
#endif

 	 	if (!wpan_mcps_data_req(src_addr_mode,
				&dst_addr,
				strlen(payload),  /* One octet */ 	 		 
				(uint8_t*)payload,
				curr_msdu_handle,
				WPAN_TXOPT_INDIRECT_ACK
#if (defined MAC_SECURITY_ZIP) || (defined MAC_SECURITY_2006)				
				,ZIP_SEC_MIN,NULL,ZIP_KEY_ID_MODE,device_list[cur_device].short_addr
#endif					
				)
				)
				 {
		}
	}

	/* Start timer to initiate indirect data transmission. */
	sw_timer_start(APP_TIMER_INDIRECT_DATA,
			((uint32_t)APP_INDIRECT_DATA_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)indirect_data_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}
#ifdef GTS_SUPPORT

#ifdef SIO_HUB
const char Display_GTS_Data[] = "GTS data for device %" PRIu8 " ";
#endif
/*
 * @brief Callback function for initiation of gts data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void gts_data_cb(void *parameter)
{
	uint16_t cur_device;
	uint8_t src_addr_mode;
	wpan_addr_spec_t dst_addr;

	/* Loop over all associated devices. */
	for (cur_device = 0; cur_device < no_of_assoc_devices; cur_device++) {
#ifdef SIO_HUB
		printf(Display_GTS_Data, cur_device + 1);
#endif

		/*
		 * Request transmission of indirect data to device.
		 * This will just queue this frame into the indirect data queue.
		 * Once this particular device polls for pending data,
		 * the frame will be delivered to the device.
		 */
		src_addr_mode = WPAN_ADDRMODE_SHORT;
		dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
		dst_addr.PANId = DEFAULT_PAN_ID;
		dst_addr.Addr.short_address
			= device_list[cur_device].short_addr;

		//payload = (uint8_t)rand(); /* Any dummy data */
		gts_msdu_handle++; /* Increment handle */

#ifdef SIO_HUB
		printf(Display_MSDU_Handle, gts_msdu_handle);
#endif
		if (!wpan_mcps_data_req(src_addr_mode,
				&dst_addr,
				GTS_PAYLOAD_LEN,  /* One octet */
				gts_payload,
				gts_msdu_handle,
				WPAN_TXOPT_GTS_ACK
#ifdef MAC_SECURITY_ZIP
				,ZIP_SEC_MIN,NULL,ZIP_KEY_ID_MODE,device_list[cur_device].short_addr
#endif /*  */
				)) {
			/*
			 * Data could not be queued into the indirect queue.
			 * Add error handling if required.
			 */
		}
	}
    
	/* Start timer to initiate indirect data transmission. */
	sw_timer_start(APP_TIMER_GTS_DATA,
			((uint32_t)APP_GTS_DATA_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)gts_data_cb,
			NULL);
	

	parameter = parameter; /* Keep compiler happy. */
}
#endif
/*
 * @brief Callback function for updating the beacon payload
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void bcn_payload_update_cb(void *parameter)
{
	/*
	 * Counter holding the variable portion of the beacon payload.
	 *
	 * Note: If this is changed, also the define BEACON_PAYLOAD_LEN needs
	 * to be updated accordingly.
	 * If this happens, the PIB attribute macBeaconPayloadLength needs to be
	 * adjusted again as well. Since in this application the length of the
	 * beacon payload never changes, this can be skipped.
	 */
	static uint8_t bcn_payload_cnt;

	/* The counter transmitted in the beacon payload is updated and
	 * the new beacon payload is set.
	 */
	bcn_payload_cnt++;
	bcn_payload_cnt %= 10;
	/* Create printable character. */
	beacon_payload[BEACON_PAYLOAD_LEN - 1] = bcn_payload_cnt + 0x30;
	wpan_mlme_set_req(macBeaconPayload, 
#if (defined MAC_SECURITY_ZIP) || (defined MAC_SECURITY_2006)
	 0,
#endif	 
	 &beacon_payload);

	/* Restart timer for updating beacon payload. */
	sw_timer_start(APP_TIMER_BCN_PAYLOAD_UPDATE,
			((uint32_t)APP_BCN_PAYLOAD_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)bcn_payload_update_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}

/*
 * @brief This function will show up the application 
 *        and stack build features and available in the firmware
 * @param void
 *                  
 */
static void print_stack_app_build_features(void)
{
#if ANTENNA_DIVERSITY   
    printf("\r\n Antenna Diversity : Enabled %d", ANTENNA_DIVERSITY);
#else
    printf("\r\n Antenna Diversity : Disabled %d", ANTENNA_DIVERSITY);	
#endif	          
			
#if ARM_MATH_CM0
    printf("\r\n ARM Cortex-M0 Math Library Support : Enabled");
#else
    printf("\r\n ARM Cortex-M0 Math Library Support : Disabled");
#endif

#ifdef BEACON_SUPPORT 
    printf("\r\n Beacon Support : Enabled");
#else
    printf("\r\n Beacon Support : Disabled");
#endif
  
#ifdef BOARD
    printf("\r\n Board Support : %d",  BOARD);
#else
    printf("\r\n Board Support : Not Defined");
#endif  
  
#ifdef CUSTOM_DEFAULT_TX_PWR
    printf("\r\n Custom default Tx Power : Defined ");
#else
   printf("\r\n Custom default Tx Power : Not used");
#endif

#if DISABLE_TSTAMP_IRQ
	printf("\r\n TRX Time Stamp IRQ : Enabled - %d", DISABLE_TSTAMP_IRQ);
#else
	printf("\r\n TRX Time Stamp IRQ : Disabled");
#endif  

#ifdef DEBUG
    printf("\r\n Debug : Enabled");
#else
    printf("\r\n Debug : Disabled");
#endif

#if TAL_TYPE
	printf("\r\n TRX Type : %d", TAL_TYPE);
#else
	printf("\r\n TRX Type : Not Specified");
#endif

#ifdef STB_ON_SAL
	printf("\r\n Security Tool Box On SAL : Enabled");
#else
	printf("\r\n Security Tool Box On SAL : Disabled");
#endif

#ifdef CUSTOM_PWR_TABLE
	printf("\r\n Power Table : Custom");
#else
	printf("\r\n Custom power table not used");
#endif

#if SAL_TYPE
	printf("\r\n SAL Type : %d", SAL_TYPE);
#else
	printf("\r\n SAL Type not defined");
#endif

