zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/coord/main.c
#ifdef EXT_RF_FRONT_END_CTRL
	printf("\r\n External RF Front End Control for External PA : Enabled");
#else
	printf("\r\n External RF Front End Control for External PA : Disabled");
#endif

#if EXTERN_EEPROM_AVAILABLE
	printf("\r\n External EEPROM Available");
#else
	printf("\r\n External EEPROM Not Available");
#endif

#if _DEBUG_
	printf("\r\n MAC Debug Support : Enabled");
#else
	printf("\r\n MAC Debug Support : Disabled");
#endif

#if TC_ASYNC
	printf("\r\n Timer Counter Asynchronous Module : Enabled");
#else
	printf("\r\n Timer Counter Asynchronous Module : Disabled");
#endif

#if PAL_USE_SPI_TRX
	printf("\r\n TRX Communication via SPI : Yes");
#else
	printf("\r\n TRX Communication via SPI : No");
#endif

#if SPI_CALLBACK_MODE
	printf("\r\n SPI Callback Mode : Enabled");
#else
	printf("\r\n SPI Callback Mode : Disabled");
#endif

#ifdef SIO_HUB
	printf("\r\n SIO Hub : Enabled");
#else
	printf("\r\n SIO Hub : Disabled");
#endif

#if (HIGHEST_STACK_LAYER == MAC)
	printf("\r\n Highest Stack Layer : MAC");
#elif (HIGHEST_STACK_LAYER == TAL)
    printf("\r\n Highest Stack Layer : TAL");
#elif (HIGHEST_STACK_LAYER == RF4CE)
	printf("\r\n Highest Stack Layer : RF4CE");	
#elif (HIGHEST_STACK_LAYER == PAL)
	printf("\r\n Highest Stack Layer : PAL");
#elif (HIGHEST_STACK_LAYER == RTB)
	printf("\r\n Highest Stack Layer : RTB");
#else
	printf("\r\n Highest Stack Layer : Not Specified");	
#endif

#if USART_CALLBACK_MODE
	printf("\r\n USART Callback Mode : Enabled");
#else
	printf("\r\n USART Callback Mode : Disabled");
#endif

#if EXTINT_CALLBACK_MODE
	printf("\r\n External Interrupt Callback Mode : Enabled");
#else
	printf("\r\n External Interrupt Callback Mode : Disabled");
#endif

#ifdef MAC_SECURITY_ZIP 
	printf("\r\n MAC Data & Security Module : Enabled");
#else
	printf("\r\n MAC Data & Security Module : Disabled");
#endif	

#ifdef MAC_SECURITY_BEACON
	printf("\r\n MAC Beacon Security : Enabled");
#else
	printf("\r\n MAC Beacon Security : Disabled");
#endif

#ifdef GTS_SUPPORT 
	printf("\r\n MAC GTS Support : Enabled");
#else
	printf("\r\n MAC GTS Support : Disabled");
#endif
}



